Revit 2026 API

# RebarContainerAppendItemFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IListCurve, RebarTerminationOrientation, RebarTerminationOrientation) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarContainerItem AppendItemFromCurvesAndShape(
	RebarShape rebarShape,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ normal,
	IList<Curve> curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient
)
```
```vb
Public Function AppendItemFromCurvesAndShape (
	rebarShape As RebarShape,
	barType As RebarBarType,
	startHook As RebarHookType,
	endHook As RebarHookType,
	normal As XYZ,
	curves As IList(Of Curve),
	startHookOrient As RebarTerminationOrientation,
	endHookOrient As RebarTerminationOrientation
) As RebarContainerItem
```
```cpp
public:
RebarContainerItem^ AppendItemFromCurvesAndShape(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ normal,
	IList<Curve^>^ curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient
)
```
```fsharp
member AppendItemFromCurvesAndShape :
        rebarShape : RebarShape *
        barType : RebarBarType *
        startHook : RebarHookType *
        endHook : RebarHookType *
        normal : XYZ *
        curves : IList<Curve> *
        startHookOrient : RebarTerminationOrientation *
        endHookOrient : RebarTerminationOrientation -> RebarContainerItem
```

#### Parameters

rebarShape RebarShape

barType RebarBarType

startHook RebarHookType

endHook RebarHookType

normal XYZ

curves IListCurve

startHookOrient RebarTerminationOrientation

endHookOrient RebarTerminationOrientation

#### Return Value

RebarContainerItem

#### Reference

RebarContainer Class

AppendItemFromCurvesAndShape Overload

Autodesk.Revit.DB.Structure Namespace